%% 判断如下系统的稳定性
clc;clear
sys1=tf([5],[1 1]);
sys2=tf([1],[1 2]);
sys3=tf([1],[1 0]);
sys4=tf([1],[1]);
sysa=series(sys1,sys2);
sysb=series(sysa,sys3);
sysall=feedback(sysb,sys4,-1)   %整个系统的传递函数
%%%%%%%%%%%%%%%%%%%%%%%%%%李亚普洛夫第一法，间接法%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
[A,B,C,D]=tf2ss(sysall.num{1},sysall.den{1})
lamda=eig(A)
fprintf('由输出可知，矩阵A的特征值均具有负实部，所以系统是渐近稳定的。\n');
%%%%%%%%%%%%%%%%②李亚普洛夫第二法，直接法，思路2,用lyap()函数%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp('下面用李亚普洛夫第二法（直接法），思路2,用lyap()函数来解：');
Q=eye(size(A,1))   %返回一个 n×n 的单位矩阵（先确定能量递减）
P=lyap(A,Q)
sign=2;
for x=1:size(P)      %希尔维斯特判据判定P是否正定
    detx=det(P(1:x,1:x))   
    if detx<=0
       sign=0;
    else 
       sign=1;
    end
end
if sign==1      %输出结果，先给Q解出P，再判断P的正定是充要条件
    fprintf('P的各阶顺序主子式均>0，所以矩阵P正定，该系统稳定！\n\n');
else
    disp('判断出错！');
end
%%%%%%%%%%%%%%%%③李亚普洛夫第二法，直接法，思路2,不用lyap()函数%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp('下面用李亚普洛夫第二法（直接法），思路2,不用lyap()函数来解：');
P=eye(size(A,1))%先选择一个正定的P 
Q=-P*A-A'*P    %然后由李亚普洛夫方程算出Q
sign2=2;
for x=1:size(Q)     
    detxx=det(Q(1:x,1:x))   
    if detxx<=0
       sign2=0;
    end
end
%**注意：先给P解出Q，再判断Q的正定是充分条件，若不正定则不能得出否定的结果！！！**%
if sign2==2      
    fprintf('各阶顺序主子式均>0，所以矩阵Q正定，该系统稳定！\n\n');
else 
     fprintf('Q的各阶顺序主子式中有≤0的，所以矩阵Q不正定，无法判断系统是否稳定！\n');
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%yalmip是一个matlab的工具包、线性规划求解器
