%% 2.7 系统设计——基于状态观测器的状态反馈（OSF）
clc;clear
%-------------调出Scope的隐藏功能-----------------
set(0,'ShowHiddenHandles','on');
set(gcf,'menubar','figure');
%----------------------------------------------
A1=[0 1 0 0;
   0 0 -1 0;
   0 0 0 1;
   0 0 22 0]
B1=[0;1;0;-2]
C1=[1 0 0 0]
D1=[0]

A=[0 1 0 0;
   0 0 -1 0;
   0 0 0 1;
   0 0 22 0]
B=[0;1;0;-2]
C=[1 0 0 0]
D=[0]
Init=[0.1 0.1 0.5 0.5];%系统的初始条件
Initobserv=[0.1 0.1 0.4 0.3];%观测器的初始条件
fprintf('因为此系统能控能观，所以根据分离定理，可分别设计反馈增益矩阵K和G。\n\n');

%①设计状态反馈增益K
P1=[-1 -1 -10 -15];   %能控子系统的期望极点P1_
fprintf('给系统配置的期望极点是：');disp(P1);
K=acker(A1,B1,P1);
fprintf('反馈增益矩阵K=  ');disp(K);
lamda_A_BK=eig(A1-B1*K);
fprintf('状态反馈之后的系统特征值为lamda_(A-BK)=\n');disp(lamda_A_BK);
fprintf('系统极点配置成功。\n');

%②设计状态观测器增益矩阵G
P2=[-5 -5 -5 -5];%观测器的期望极点
fprintf('给观测器配置的期望极点是：');disp(P2);
G=acker(A1',C1',P2);
G=G';
fprintf('反馈增益矩阵G= \n');disp(G);
fprintf('观测器极点为：\n');disp(eig(A1-G*C1));
fprintf('观测器极点配置成功。\n');
