%% 2.8 系统设计——状态反馈+比例输出反馈，跟踪阶跃输入
clc;clear
%-------------调出Scope的隐藏功能-----------------
set(0,'ShowHiddenHandles','on');
set(gcf,'menubar','figure');
%----------------------------------------------
A1=[0 1 0 0;
   0 0 -1 0;
   0 0 0 1;
   0 0 22 0]
B1=[0;1;0;-2]
C1=[1 0 0 0]
D1=[0]

A=[0 1 0 0;
   0 0 -1 0;
   0 0 0 1;
   0 0 22 0]
B=[0;1;0;-2]
C=[1 0 0 0]
D=[0]
Init=[0.1 0.1 0.5 0.5];%系统的初始条件

fprintf('因为此系统完全能控，所以可以任意配置极点。\n\n');

%设计状态反馈增益K
P=[-1 -1 -10 -15];   %能控子系统的期望极点P
fprintf('给系统配置的期望极点是：');disp(P);
K=acker(A,B,P)
lamda_A_BK=eig(A-B*K);
fprintf('状态反馈之后的系统特征值为lamda_(A-BK)=\n');disp(lamda_A_BK);
fprintf('系统极点配置成功。\n');