%% 2.9 系统设计——状态反馈+带积分校正的输出反馈，跟踪阶跃输入
clc;clear
%-------------调出Scope的隐藏功能-----------------
set(0,'ShowHiddenHandles','on');
set(gcf,'menubar','figure');
%----------------------------------------------
A=[0 1 0 0;
   0 0 -1 0;
   0 0 0 1;
   0 0 22 0]
B=[0;1;0;-2]
C=[1 0 0 0]
D=[0]
Init=[0 0.1 0.005 0.1 ];%系统的初始条件

%设计状态反馈增益K
%***********************************************
%选择误差带Δ=0.05，则调节时间ts=3.5/ζWn=3.5/σ
%阻尼比zeta(ζ)只和超调量xigema（σ）有关系，
%且为： ζ=sqrt((log(1/σ))^2/((pi)^2+(log(1/σ))^2))，
ts=10;%选择调节时间ts=10s
xigema=3.5/ts;%计算超调量σ
zeta = sqrt((log(1/xigema))^2/((pi)^2 + (log(1/xigema))^2))
Wn=3.5/(ts*zeta) ;%自然频率Wn
P1=-zeta*Wn+Wn*sqrt(zeta^2-1)
P2=-zeta*Wn-Wn*sqrt(zeta^2-1)
P=[P1 P2 -20 -21 -22];
%由于加入积分环节，系统会增加一个新的状态变量w，
%变成5阶系统，具有新的状态空间表达式。
A1=[A [0 0 0 0]';
    -C    0    ];%等效大系统的系统矩阵
B1=[B;0];%等效大系统的输入矩阵
K=acker(A1,B1,P);%等效大系统的反馈增益矩阵K
lamda_A1_B1K=eig(A1-B1*K);
fprintf('状态反馈之后的等效系统特征值为lamda_(A-BK)=\n');disp(lamda_A1_B1K);
fprintf('系统极点配置成功。\n\n');
fprintf('原系统的反馈增益矩阵K1和积分增益K2为：\n');
K1=K(:,1:4)
K2=-K(:,5:5)